====================
integer expression
====================

{{ 2 }}

---

(template
  (jinja_expression
    (integer))
)

====================
float expression
====================

{{ 2.123 }}

---

(template
  (jinja_expression
    (float))
)

====================
string expression
====================

{{ "string" }}

---

(template
  (jinja_expression
    (string))
)

====================
bool expression
====================

{{ True }}

---

(template
  (jinja_expression
    (boolean))
)
